; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-8-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-2 - location
	p2-1 - location
	p2-6 - location
	p2-12 - location
	p3-0 - location
	p3-5 - location
	p3-10 - location
	p4-5 - location
	p5-13 - location
	p6-4 - location
	p6-7 - location
	p6-8 - location
	p7-6 - location
	p7-11 - location
	p8-0 - location
	p8-1 - location
	p8-5 - location
	p8-9 - location
	p9-1 - location
	p9-4 - location
	p9-5 - location
	p10-4 - location
	p10-9 - location
	p11-7 - location
	p12-0 - location
	p13-3 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s13)
	(at driver3 s5)
	(at driver4 s0)
	(at truck1 s10)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s10)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s13)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s10)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s0)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s13)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s3)
	(at package2 s3)
	(at package3 s8)
	(at package4 s10)
	(at package5 s6)
	(at package6 s7)
	(at package7 s10)
	(at package8 s7)
	(at package9 s8)
	(at package10 s7)
	(at package11 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-13)
	(path p5-13 s5)
	(path s13 p5-13)
	(path p5-13 s13)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-11)
	(path p7-11 s7)
	(path s11 p7-11)
	(path p7-11 s11)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(path s10 p10-9)
	(path p10-9 s10)
	(path s9 p10-9)
	(path p10-9 s9)
	(path s12 p12-0)
	(path p12-0 s12)
	(path s0 p12-0)
	(path p12-0 s0)
	(path s13 p13-3)
	(path p13-3 s13)
	(path s3 p13-3)
	(path p13-3 s3)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 97)
	(= (time-to-drive s8 s0) 97)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 33)
	(= (time-to-drive s3 s1) 33)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 16)
	(= (time-to-drive s4 s1) 16)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 15)
	(= (time-to-drive s12 s1) 15)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 67)
	(= (time-to-drive s13 s1) 67)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 69)
	(= (time-to-drive s4 s2) 69)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 24)
	(= (time-to-drive s11 s2) 24)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 74)
	(= (time-to-drive s6 s3) 74)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 77)
	(= (time-to-drive s0 s4) 77)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 20)
	(= (time-to-drive s8 s4) 20)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 51)
	(= (time-to-drive s11 s4) 51)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 89)
	(= (time-to-drive s3 s5) 89)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 26)
	(= (time-to-drive s9 s5) 26)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 32)
	(= (time-to-drive s11 s6) 32)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 23)
	(= (time-to-drive s1 s7) 23)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 65)
	(= (time-to-drive s2 s7) 65)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 52)
	(= (time-to-drive s11 s7) 52)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 63)
	(= (time-to-drive s3 s8) 63)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 97)
	(= (time-to-drive s5 s8) 97)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 22)
	(= (time-to-drive s7 s8) 22)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 7)
	(= (time-to-drive s3 s9) 7)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 96)
	(= (time-to-drive s6 s9) 96)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 59)
	(= (time-to-drive s8 s9) 59)
	(link s9 s13)
	(link s13 s9)
	(= (time-to-drive s9 s13) 82)
	(= (time-to-drive s13 s9) 82)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 8)
	(= (time-to-drive s0 s10) 8)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 3)
	(= (time-to-drive s2 s10) 3)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 14)
	(= (time-to-drive s3 s10) 14)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 90)
	(= (time-to-drive s4 s10) 90)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 67)
	(= (time-to-drive s5 s10) 67)
	(link s10 s6)
	(link s6 s10)
	(= (time-to-drive s10 s6) 86)
	(= (time-to-drive s6 s10) 86)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 12)
	(= (time-to-drive s7 s10) 12)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 63)
	(= (time-to-drive s11 s10) 63)
	(link s10 s12)
	(link s12 s10)
	(= (time-to-drive s10 s12) 19)
	(= (time-to-drive s12 s10) 19)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 28)
	(= (time-to-drive s3 s11) 28)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 78)
	(= (time-to-drive s8 s11) 78)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 86)
	(= (time-to-drive s9 s11) 86)
	(link s12 s5)
	(link s5 s12)
	(= (time-to-drive s12 s5) 96)
	(= (time-to-drive s5 s12) 96)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 2)
	(= (time-to-drive s8 s12) 2)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 60)
	(= (time-to-drive s11 s12) 60)
	(link s12 s13)
	(link s13 s12)
	(= (time-to-drive s12 s13) 73)
	(= (time-to-drive s13 s12) 73)
	(link s13 s10)
	(link s10 s13)
	(= (time-to-drive s13 s10) 22)
	(= (time-to-drive s10 s13) 22)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s12)
	(at driver4 s8)
	(at truck2 s3)
	(at truck5 s5)
	(at truck7 s13)
	(at truck8 s13)
	(at package1 s4)
	(at package2 s4)
	(at package3 s1)
	(at package4 s2)
	(at package5 s5)
	(at package6 s1)
	(at package7 s1)
	(at package8 s11)
	(at package9 s12)
	(at package10 s12)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver2 truck5 s13)
   deleted: (at driver2 s13) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 1 of 16
2. (drive-truck truck5 s13 s12 driver2)
   deleted: (at truck5 s13)
   added: (at truck5 s12)
   changed: (fuel-used) from 0 to 730
   goals met: 1 of 16
3. (drive-truck truck5 s12 s11 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s11)
   changed: (fuel-used) from 730 to 1330
   goals met: 1 of 16
4. (drive-truck truck5 s11 s3 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s3)
   changed: (fuel-used) from 1330 to 1610
   goals met: 1 of 16
5. (load-truck package1 truck5 s3)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 1 of 16
6. (load-truck package2 truck5 s3)
   deleted: (at package2 s3)
   added: (in package2 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 1 of 16
7. (drive-truck truck5 s3 s11 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s11)
   changed: (fuel-used) from 1610 to 1974
   goals met: 1 of 16
8. (board-truck driver4 truck7 s0)
   deleted: (at driver4 s0) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 1 of 16
9. (drive-truck truck7 s0 s4 driver4)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   changed: (fuel-used) from 1974 to 2744
   goals met: 1 of 16
10. (drive-truck truck7 s4 s1 driver4)
   deleted: (at truck7 s4)
   added: (at truck7 s1)
   changed: (fuel-used) from 2744 to 2904
   goals met: 1 of 16
11. (disembark-truck driver4 truck7 s1)
   deleted: (driving driver4 truck7)
   added: (at driver4 s1) (empty truck7)
   goals met: 1 of 16
12. (drive-truck truck5 s11 s10 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s10)
   changed: (fuel-used) from 2904 to 3723
   goals met: 1 of 16
13. (load-truck package4 truck5 s10)
   deleted: (at package4 s10)
   added: (in package4 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 1 of 16
14. (load-truck package7 truck5 s10)
   deleted: (at package7 s10)
   added: (in package7 truck5)
   changed: (load truck5) from 3 to 4, (fuel-per-minute truck5) from 16 to 20
   goals met: 1 of 16
15. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 1 of 16
16. (drive-truck truck2 s1 s12 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s12)
   changed: (fuel-used) from 3723 to 3873
   goals met: 1 of 16
17. (drive-truck truck2 s12 s8 driver4)
   deleted: (at truck2 s12)
   added: (at truck2 s8)
   changed: (fuel-used) from 3873 to 3893
   goals met: 1 of 16
18. (load-truck package9 truck2 s8)
   deleted: (at package9 s8)
   added: (in package9 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 1 of 16
19. (load-truck package3 truck2 s8)
   deleted: (at package3 s8)
   added: (in package3 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 16
20. (drive-truck truck2 s8 s12 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s12)
   changed: (fuel-used) from 3893 to 3919
   goals met: 1 of 16
21. (unload-truck package9 truck2 s12)
   deleted: (in package9 truck2)
   added: (at package9 s12)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 2 of 16
22. (drive-truck truck2 s12 s1 driver4)
   deleted: (at truck2 s12)
   added: (at truck2 s1)
   changed: (fuel-used) from 3919 to 4084
   goals met: 2 of 16
23. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 3 of 16
24. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 3 of 16
25. (walk driver4 s1 p8-1)
   deleted: (at driver4 s1)
   added: (at driver4 p8-1)
   goals met: 3 of 16
26. (drive-truck truck5 s10 s12 driver2)
   deleted: (at truck5 s10)
   added: (at truck5 s12)
   changed: (fuel-used) from 4084 to 4464
   goals met: 3 of 16
27. (walk driver1 s6 p2-6)
   deleted: (at driver1 s6)
   added: (at driver1 p2-6)
   goals met: 3 of 16
28. (walk driver1 p2-6 s2)
   deleted: (at driver1 p2-6)
   added: (at driver1 s2)
   goals met: 3 of 16
29. (walk driver1 s2 p2-12)
   deleted: (at driver1 s2)
   added: (at driver1 p2-12)
   goals met: 3 of 16
30. (walk driver1 p2-12 s12)
   deleted: (at driver1 p2-12)
   added: (at driver1 s12)
   goals met: 4 of 16
31. (walk driver4 p8-1 s8)
   deleted: (at driver4 p8-1)
   added: (at driver4 s8)
   goals met: 5 of 16
32. (drive-truck truck5 s12 s1 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s1)
   changed: (fuel-used) from 4464 to 4764
   goals met: 5 of 16
33. (unload-truck package7 truck5 s1)
   deleted: (in package7 truck5)
   added: (at package7 s1)
   changed: (load truck5) from 4 to 3, (fuel-per-minute truck5) from 20 to 16
   goals met: 6 of 16
34. (drive-truck truck5 s1 s7 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s7)
   changed: (fuel-used) from 4764 to 5132
   goals met: 6 of 16
35. (drive-truck truck5 s7 s2 driver2)
   deleted: (at truck5 s7)
   added: (at truck5 s2)
   changed: (fuel-used) from 5132 to 6172
   goals met: 6 of 16
36. (unload-truck package4 truck5 s2)
   deleted: (in package4 truck5)
   added: (at package4 s2)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 7 of 16
37. (drive-truck truck5 s2 s11 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s11)
   changed: (fuel-used) from 6172 to 6484
   goals met: 7 of 16
38. (walk driver4 s8 p8-1)
   deleted: (at driver4 s8)
   added: (at driver4 p8-1)
   goals met: 6 of 16
39. (drive-truck truck5 s11 s6 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s6)
   changed: (fuel-used) from 6484 to 6900
   goals met: 6 of 16
40. (load-truck package5 truck5 s6)
   deleted: (at package5 s6)
   added: (in package5 truck5)
   changed: (load truck5) from 2 to 3, (fuel-per-minute truck5) from 13 to 16
   goals met: 6 of 16
41. (drive-truck truck5 s6 s11 driver2)
   deleted: (at truck5 s6)
   added: (at truck5 s11)
   changed: (fuel-used) from 6900 to 7412
   goals met: 6 of 16
42. (drive-truck truck5 s11 s4 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s4)
   changed: (fuel-used) from 7412 to 8228
   goals met: 6 of 16
43. (unload-truck package1 truck5 s4)
   deleted: (in package1 truck5)
   added: (at package1 s4)
   changed: (load truck5) from 3 to 2, (fuel-per-minute truck5) from 16 to 13
   goals met: 7 of 16
44. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 8 of 16
45. (drive-truck truck5 s4 s11 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s11)
   changed: (fuel-used) from 8228 to 8789
   goals met: 8 of 16
46. (drive-truck truck5 s11 s12 driver2)
   deleted: (at truck5 s11)
   added: (at truck5 s12)
   changed: (fuel-used) from 8789 to 9449
   goals met: 8 of 16
47. (walk driver4 p8-1 s1)
   deleted: (at driver4 p8-1)
   added: (at driver4 s1)
   goals met: 8 of 16
48. (drive-truck truck5 s12 s5 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s5)
   changed: (fuel-used) from 9449 to 10505
   goals met: 9 of 16
49. (unload-truck package5 truck5 s5)
   deleted: (in package5 truck5)
   added: (at package5 s5)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 10 of 16
50. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 10 of 16
51. (drive-truck truck2 s1 s7 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s7)
   changed: (fuel-used) from 10505 to 10735
   goals met: 10 of 16
52. (load-truck package6 truck2 s7)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 10 of 16
53. (load-truck package8 truck2 s7)
   deleted: (at package8 s7)
   added: (in package8 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 10 of 16
54. (load-truck package10 truck2 s7)
   deleted: (at package10 s7)
   added: (in package10 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 10 of 16
55. (drive-truck truck2 s7 s1 driver4)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 10735 to 11103
   goals met: 10 of 16
56. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 16
57. (drive-truck truck2 s1 s12 driver4)
   deleted: (at truck2 s1)
   added: (at truck2 s12)
   changed: (fuel-used) from 11103 to 11298
   goals met: 11 of 16
58. (unload-truck package10 truck2 s12)
   deleted: (in package10 truck2)
   added: (at package10 s12)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 12 of 16
59. (drive-truck truck2 s12 s8 driver4)
   deleted: (at truck2 s12)
   added: (at truck2 s8)
   changed: (fuel-used) from 11298 to 11320
   goals met: 12 of 16
60. (drive-truck truck5 s5 s12 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s12)
   changed: (fuel-used) from 11320 to 12280
   goals met: 11 of 16
61. (drive-truck truck2 s8 s11 driver4)
   deleted: (at truck2 s8)
   added: (at truck2 s11)
   changed: (fuel-used) from 12280 to 13138
   goals met: 11 of 16
62. (unload-truck package8 truck2 s11)
   deleted: (in package8 truck2)
   added: (at package8 s11)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 12 of 16
63. (drive-truck truck2 s11 s8 driver4)
   deleted: (at truck2 s11)
   added: (at truck2 s8)
   changed: (fuel-used) from 13138 to 13918
   goals met: 12 of 16
64. (disembark-truck driver4 truck2 s8)
   deleted: (driving driver4 truck2)
   added: (at driver4 s8) (empty truck2)
   goals met: 13 of 16
65. (drive-truck truck5 s12 s5 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s5)
   changed: (fuel-used) from 13918 to 14878
   goals met: 14 of 16
66. (walk driver4 s8 p8-1)
   deleted: (at driver4 s8)
   added: (at driver4 p8-1)
   goals met: 13 of 16
67. (walk driver4 p8-1 s1)
   deleted: (at driver4 p8-1)
   added: (at driver4 s1)
   goals met: 13 of 16
68. (board-truck driver4 truck7 s1)
   deleted: (at driver4 s1) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 13 of 16
69. (drive-truck truck5 s5 s8 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s8)
   changed: (fuel-used) from 14878 to 15848
   goals met: 12 of 16
70. (disembark-truck driver4 truck7 s1)
   deleted: (driving driver4 truck7)
   added: (at driver4 s1) (empty truck7)
   goals met: 12 of 16
71. (disembark-truck driver2 truck5 s8)
   deleted: (driving driver2 truck5)
   added: (at driver2 s8) (empty truck5)
   goals met: 12 of 16
72. (walk driver4 s1 p8-1)
   deleted: (at driver4 s1)
   added: (at driver4 p8-1)
   goals met: 12 of 16
73. (board-truck driver2 truck2 s8)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 16
74. (drive-truck truck2 s8 s3 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   changed: (fuel-used) from 15848 to 16478
   goals met: 13 of 16
75. (walk driver4 p8-1 s8)
   deleted: (at driver4 p8-1)
   added: (at driver4 s8)
   goals met: 14 of 16
76. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 16478 to 16808
   goals met: 13 of 16
77. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 13 of 16
78. (board-truck driver2 truck7 s1)
   deleted: (at driver2 s1) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 13 of 16
79. (drive-truck truck7 s1 s13 driver2)
   deleted: (at truck7 s1)
   added: (at truck7 s13)
   changed: (fuel-used) from 16808 to 17478
   goals met: 14 of 16
80. (walk driver4 s8 p8-1)
   deleted: (at driver4 s8)
   added: (at driver4 p8-1)
   goals met: 13 of 16
81. (walk driver4 p8-1 s1)
   deleted: (at driver4 p8-1)
   added: (at driver4 s1)
   goals met: 13 of 16
82. (walk driver3 s5 p8-5)
   deleted: (at driver3 s5)
   added: (at driver3 p8-5)
   goals met: 13 of 16
83. (walk driver3 p8-5 s8)
   deleted: (at driver3 p8-5)
   added: (at driver3 s8)
   goals met: 13 of 16
84. (board-truck driver3 truck5 s8)
   deleted: (at driver3 s8) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 13 of 16
85. (drive-truck truck5 s8 s5 driver3)
   deleted: (at truck5 s8)
   added: (at truck5 s5)
   changed: (fuel-used) from 17478 to 18448
   goals met: 14 of 16
86. (board-truck driver4 truck2 s1)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 14 of 16
87. (drive-truck truck7 s13 s12 driver2)
   deleted: (at truck7 s13)
   added: (at truck7 s12)
   changed: (fuel-used) from 18448 to 19178
   goals met: 13 of 16
88. (disembark-truck driver2 truck7 s12)
   deleted: (driving driver2 truck7)
   added: (at driver2 s12) (empty truck7)
   goals met: 13 of 16
89. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 13 of 16
90. (walk driver4 s1 p8-1)
   deleted: (at driver4 s1)
   added: (at driver4 p8-1)
   goals met: 13 of 16
91. (walk driver4 p8-1 s8)
   deleted: (at driver4 p8-1)
   added: (at driver4 s8)
   goals met: 14 of 16
92. (board-truck driver1 truck7 s12)
   deleted: (at driver1 s12) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 13 of 16
93. (drive-truck truck7 s12 s1 driver1)
   deleted: (at truck7 s12)
   added: (at truck7 s1)
   changed: (fuel-used) from 19178 to 19328
   goals met: 13 of 16
94. (disembark-truck driver1 truck7 s1)
   deleted: (driving driver1 truck7)
   added: (at driver1 s1) (empty truck7)
   goals met: 13 of 16
95. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 13 of 16
96. (drive-truck truck2 s1 s3 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 19328 to 19658
   goals met: 14 of 16
97. (drive-truck truck2 s3 s11 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s11)
   changed: (fuel-used) from 19658 to 19938
   goals met: 13 of 16
98. (walk driver4 s8 p8-1)
   deleted: (at driver4 s8)
   added: (at driver4 p8-1)
   goals met: 12 of 16
99. (walk driver4 p8-1 s1)
   deleted: (at driver4 p8-1)
   added: (at driver4 s1)
   goals met: 12 of 16
100. (board-truck driver4 truck7 s1)
   deleted: (at driver4 s1) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 12 of 16
101. (drive-truck truck7 s1 s13 driver4)
   deleted: (at truck7 s1)
   added: (at truck7 s13)
   changed: (fuel-used) from 19938 to 20608
   goals met: 13 of 16
102. (drive-truck truck2 s11 s12 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s12)
   changed: (fuel-used) from 20608 to 21208
   goals met: 13 of 16
103. (disembark-truck driver1 truck2 s12)
   deleted: (driving driver1 truck2)
   added: (at driver1 s12) (empty truck2)
   goals met: 14 of 16
104. (board-truck driver2 truck2 s12)
   deleted: (at driver2 s12) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 14 of 16
105. (drive-truck truck2 s12 s10 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s10)
   changed: (fuel-used) from 21208 to 21398
   goals met: 14 of 16
106. (disembark-truck driver4 truck7 s13)
   deleted: (driving driver4 truck7)
   added: (at driver4 s13) (empty truck7)
   goals met: 14 of 16
107. (drive-truck truck2 s10 s7 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (fuel-used) from 21398 to 21518
   goals met: 14 of 16
108. (drive-truck truck2 s7 s11 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (fuel-used) from 21518 to 22038
   goals met: 14 of 16
109. (walk driver4 s13 p5-13)
   deleted: (at driver4 s13)
   added: (at driver4 p5-13)
   goals met: 14 of 16
110. (drive-truck truck2 s11 s3 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s3)
   changed: (fuel-used) from 22038 to 22318
   goals met: 15 of 16
111. (walk driver4 p5-13 s5)
   deleted: (at driver4 p5-13)
   added: (at driver4 s5)
   goals met: 15 of 16
112. (walk driver4 s5 p8-5)
   deleted: (at driver4 s5)
   added: (at driver4 p8-5)
   goals met: 15 of 16
113. (walk driver4 p8-5 s8)
   deleted: (at driver4 p8-5)
   added: (at driver4 s8)
   goals met: 16 of 16
